import React from 'react';
import './App.css';
import Image from './Ekaterina2.jpg';
import textImage from "./ekatirina.jpg";

export class Ekaterina2 extends React.Component {

  constructor(props) {
    super(props);
    this.state = { answer: [], };
    this.changeCheckbox = this.changeCheckbox.bind(this);
  }

  render() {
  return(
    <div className="contener">
      <div>
        <div className="text-conteiner"><img src={Image} className="fon"/>
        <div>
          <div className="text">
          <img 
          src={textImage} 
          width="235" 
          alt="Иллюстрация" 
          align="left" 
          vspace="5" 
          hspace="5"/>
         Екатерина II вошла в историю России как императрица-просветительница. Она по праву считается преемницей дела Петра Великого.
Иностранка по происхождению, она искренне любила Россию и заботилась о благе своих подданных. Заняв престол посредством дворцового переворота, супруга Петра III попыталась воплотить в жизнь русского общества лучшие идеи европейского Просвещения. В тоже время Екатерина выступила против начавшейся Великой Французской революции (1789-1799 гг.), возмутившись казнью французского короля Людовика XVI Бурбона (21 января 1793 г.) и предрешив участие России в антифранцузской коалиции европейских государств в начале XIX в. Екатерина II Алексеевна (урожденная София Августа Фредерика, принцесса Ангальт-Цербстская) родилась 2 мая 1729 г. в немецком городе Штеттин (совр. территория Польши), а скончалась 17 ноября 1796 г. в Санкт-Петербурге. Дочь находившегося на прусской службе принца Христиана-Августа Ангальт-Цербстского и принцессы Иоганны-Елизаветы (урожденной принцессы Голштейн-Готторпской) была в родстве с королевскими домами Швеции, Пруссии и Англии. Получила домашнее образование, в курс которого кроме танцев и иностранных языков входили также основы истории, географии и богословия. В 1744 г. она вместе с матерью была приглашена в Россию императрицей Елизаветой Петровной, и крещена по православному обычаю под именем Екатерины Алексеевны. Вскоре было объявлено о ее помолвке с великим князем Петром Федоровичем (будущим императором Петром III), а в 1745 г. они венчались. Екатерина понимала, что двор любит Елизавету, не принимает многих странностей наследника престола, и, возможно, после смерти Елизаветы именно ей при поддержке двора предстоит взойти на русский престол. Екатерина изучала труды деятелей французского Просвещения, а также юриспруденцию, что оказало существенное влияние на ее мировоззрение. Кроме того, она прилагала как можно больше усилий, чтобы изучить, а, возможно, и понять историю и традиции Российского государства. Из-за своего стремления познать все русское Екатерина завоевала любовь не только двора, но и всего Петербурга. После смерти Елизаветы Петровны, отношения Екатерины с мужем, никогда не отличавшиеся теплотой и пониманием, продолжали ухудшаться, принимая явно враждебные формы. Опасаясь ареста, Екатерина при поддержке братьев Орловых, Н.И. Панина, К.Г. Разумовского, Е.Р. Дашковой в ночь на 28 июня 1762 г., когда император находился в Ораниенбауме, совершила дворцовый переворот. Петр III был сослан в Ропшу, где вскоре при загадочных обстоятельствах погиб. Начав свое правление, Екатерина попыталась воплотить в жизнь идеи Просвещения и устроить государство сообразно с идеалами этого мощнейшего европейского интеллектуального движения. Она чуть ли не с первых дней правления активно участвует в государственных делах, предлагая значимые для общества реформы. По ее инициативе, в 1763 г. была проведена реформа Сената, которая значительно повысила эффективность его работы. Желая усилить зависимость церкви от государства, и предоставить дополнительные земельные ресурсы дворянству, поддерживающему политику реформирования общества, Екатерина провела секуляризацию церковных земель (1754 г.). Началась унификация управления территориями Российской империи, и было упразднено гетманство на Украине. Поборница Просвещения Екатерина создает ряд новых учебных заведений, в том числе для женщин (Смольный институт, Екатерининское училище). В 1767 г. императрица созвала комиссию, в которую вошли представители всех слоев населения, включая крестьян (кроме крепостных), для сочинения нового уложения — свода законов. Чтобы направить работу Уложенной комиссии Екатерина написала «Наказ», текст которого основывался на сочинениях авторов-просветителей. Этот документ, по сути, являлся либеральной программой ее царствования. После окончания русско-турецкой войны 1768-1774 гг. и подавления восстания под предводительством Емельяна Пугачева начался новый этап екатерининских реформ, когда императрица самостоятельно разрабатывала важнейшие законодательные акты и, пользуясь неограниченностью своей власти, претворяла их в жизнь. В 1775 г. был издан манифест, дозволявший свободное открытие любых промышленных предприятий. В том же году была осуществлена губернская реформа, которой введено новое административно-территориальное деление страны, сохранявшееся вплоть до 1917 г. В 1785 г. Екатерина издала жалованные грамоты дворянству и городам. На внешнеполитической арене Екатерина II продолжала проводить наступательную политику на всех направлениях — северном, западном и южном. Итогами внешней политики можно назвать усиление влияния России на европейские дела, три раздела Речи Посполитой, укрепление позиций в Прибалтике, присоединение Крыма, Грузии, участие в противодействии силам революционной Франции. Вклад Екатерины II в русскую историю настолько значителен, что память о ней хранят многие произведения нашей культуры. 

         </div>
<div className="question">
  <p>Для чего Екатерина 2 в 1767г созвала комиссию. В которую входили даже крестьяне?</p>
    <p> <input type="checkbox" id="1" onChange={this.changeCheckbox}/>Для отмены крепостного права
    </p>
   <p> <input type="checkbox" id="2" onChange={this.changeCheckbox}/> Для выдачи новых земель помещикам</p>
<p><input type="checkbox" id="3" onChange={this.changeCheckbox}/>Для объявления о войне с Прусией
</p>
<p> <input type="checkbox" id="4" onChange={this.changeCheckbox}/>Для сочинения нового уложения — свода законов </p>
<p> <input type="checkbox" id="5" onChange={this.changeCheckbox}/>Для проведения реформы Сената</p>
</div> 
{this.state.validateStr&&
<p className="error-text"> Не верно! Попробуй ещё раз!</p>}
<button  className="check-button" onClick={this.checkAnswer}>Проверить и перейти на следующий шаг</button>
        </div>
        </div>
      </div>
    </div>
  ) 
  }

  changeCheckbox=(e)=>{
    if(e.currentTarget.checked){
      this.setState({answer:[...this.state.answer, e.currentTarget.id], validateStr:false})
    }
    else{
      this.setState({answer:this.state.answer.filter(a=>a!==e.currentTarget.id), validateStr:false})
    }
  }

  checkAnswer=()=>{
    if(this.state.answer.length===1 && this.state.answer[0]==="4"){
this.props.goNewPage(4);
    }
    else{
      this.setState({validateStr:true})
    }
  }

}

